000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ВходящиеЗвонкиАстерикс/ВходящиеЗвонкиАстерикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВходящиеЗвонкиАстерикс</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>НомерОператора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СотрудникКоллЦентра</name>
    <type>
      <types>CatalogRef.СотрудникиКоллЦентра</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/РолиСотрудниковКоллЦентра/РолиСотрудниковКоллЦентра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиСотрудниковКоллЦентра</name>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>СуперВайзер</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ВходящиеЗвонкиАстерикс/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СотрудникКоллЦентра") Тогда
		Если Параметры.СотрудникКоллЦентра.РольСотрудника = Перечисления.РолиСотрудниковКоллЦентра.Сотрудник Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("СотрудникКоллЦентра", Параметры.СотрудникКоллЦентра); 
		Иначе 
			Список.Параметры.УстановитьЗначениеПараметра("СотрудникКоллЦентра", Справочники.СотрудникиКоллЦентра.ПустаяСсылка());
		КонецЕсли;	
	Иначе 
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникКоллЦентра", Справочники.СотрудникиКоллЦентра.ПустаяСсылка());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ОбщаяФорма.ФормаВходящегоЗвонкаКлиента", Новый Структура("Объект", Элемент.ТекущиеДанные.Контрагент), ЭтаФорма); 
	
КонецПроцедуры
